<template>
  <div class="about">
    <h1>Задачи приложения</h1>
    <h3>Реализовать несколько форм и списков</h3>
    <p>
      Цель: Научится создавать формы и работать с данными в приложении.<br>
      Какие скиллы тренируем в ДЗ: работа с формами, передача данных между компонентами<br>
      <ol class="about__list">
        <li>Создать репозиторий на github</li>
        <li>Сделать проект на vue с использованием vue-cli</li>
        <li>Создать CRUD приложение по типу книжный магазин. В приложении будет 2 типа сущностей: авторы и книги.</li>
        <li>Сделать МР и прислать ссылку</li>
      </ol>
    </p>
    <h3>Реализовать страницы</h3>
    <p>
      <ol class="about__list">
        <li>список книг</li>
        <li>список авторов</li>
        <li>добавление автора</li>
        <li>добавление книги</li>
      </ol>
    </p>
    <h3>Формы</h3>
    <p>
      <ol class="about__list">
        <li>добавления книг</li>
        <li>добавления авторов</li>
        <li>поиск книг по нескольким параметрам - название, год выпуска, категория, цена</li>
      </ol>
    </p>
    <h3>Прочий функционал</h3>
    <p>
      <ol class="about__list">
        <li>кнопка удаления книг</li>
      </ol>
    </p>
    <h3>Примечание</h3>
    <p>
      Модель автора включает: ФИО, ДР, пол, страну проживания, написанные книги,<br>
      Модель книги включает: ISBN, название, автор/список авторов, картинку, краткое описание, теги, цена, категория
    </p>
    <hr>
    <h3>Задачи со звездочкой</h3>
    <p>
      <ul class="about__list-stars">
        <li>1 ★ - Использовать CSS-препроцессор (на ваш выбор)</li>
        <li>1 ★ - Опубликовать проект (netlify, heroku, github pages, AWS)</li>
        <li>2 ★ - Написать unit-тесты</li>
        <li>2 ★ - использовать TypeScript</li>
        <li> 2 ★ - использовать Composition API из Vue v3</li>
      </ul>
    </p>
  </div>
</template>

<style scoped lang="sass">
  .about
    &__list
      text-align: left
    &__list-stars
      list-style: none
      text-align: left
</style>
